app/controllers/entities_controller.rb

  def index
    render json: Entity.all.pluck(:name).to_json
---
SELECT "entities"."name" FROM "entities"