app/controllers/reports_controller.rb

INSERT INTO "reports" ("entity", "locations", "reason", "title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["entity", ""], ["locations", "Bali"], ["reason", ""], ["title", ""], ["description", ""], ["created_at", "2015-12-05 04:43:38.519713"], ["updated_at", "2015-12-05 04:43:38.519713"]]
---
  def create
    @report = Report.new(report_params)

    respond_to do |format|
      if @report.save

UPDATE "reports" SET "locations" = ?, "date_of_incident" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["locations", "Bali"], ["date_of_incident", "2015-12-25"], ["updated_at", "2015-12-05 04:47:41.110352"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @report.update(report_params)