app/controllers/sessions_controller.rb

  def create
    auth = request.env["omniauth.auth"]

    user = User.where(:provider => auth['provider'],
                      :uid => auth['uid'].to_s).first || User.create_with_omniauth(auth)

    user.update(fb_token: auth['credentials']['token'])
---
INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["provider", "facebook"], ["uid", "10206349721836512"], ["name", "Khanh Nguyen"], ["created_at", "2015-12-04 13:58:48.798556"], ["updated_at", "2015-12-04 13:58:48.798556"]]
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["provider", "facebook"], ["uid", "10206349721836512"]]
UPDATE "users" SET "fb_token" = ?, "updated_at" = ? WHERE "users"."id" = ?