app/views/reports/_form.html.erb

SELECT "entities"."name" FROM "entities"
---

  var entities = new Bloodhound({
  datumTokenizer: Bloodhound.tokenizers.obj.whitespace('name'),
  queryTokenizer: Bloodhound.tokenizers.whitespace,
  local: <%= raw Entity.all.map {|e| {name: e.name}}.to_json %>
});